МТСД/src/InformationRegisters/МТСД_ОбъектыДляПостобработкиПослеПолученияДанныхОтМТСД/МТСД_ОбъектыДляПостобработкиПослеПолученияДанныхОтМТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МТСД_ОбъектыДляПостобработкиПослеПолученияДанныхОтМТСД</name>
  <resources>
    <name>ДатаПолученияОбъекта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕстьОшибкаПостОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыполнятьПовторнуюОбработкуПослеОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.МТСД_СсылочныеТипыДоступныеВАвтономномРежиме</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УзелМТСД</name>
    <type>
      <types>ExchangePlanRef.МТСД</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МТСД/src/InformationRegisters/МТСД_ОбъектыДляПостобработкиПослеПолученияДанныхОтМТСД/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗарегистрироватьОбъект(Объект, УзелМТСД) Экспорт
	
	МенеджерЗаписи = НовыйМенеджерЗаписи(Объект, УзелМТСД, Ложь);
	МенеджерЗаписи.ДатаПолученияОбъекта = ТекущаяДатаСеанса();
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура УдалитьРегистрациюОбъекта(Объект, УзелМТСД) Экспорт
	
	МенеджерЗаписи = НовыйМенеджерЗаписи(Объект, УзелМТСД);
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистирироватьОшибкуОбрабокти(Объект, УзелМТСД, ТекстОшибки, ВыполнятьПовторнуюОбработкуПослеОшибки = Ложь)
	
	МенеджерЗаписи = НовыйМенеджерЗаписи(Объект, УзелМТСД);
	МенеджерЗаписи.ЕстьОшибкаПостОбработки = Истина;
	МенеджерЗаписи.ВыполнятьПовторнуюОбработкуПослеОшибки = ВыполнятьПовторнуюОбработкуПослеОшибки;
	МенеджерЗаписи.ТекстОшибки = ТекстОшибки;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьПостОбработку() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ * ИЗ РегистрСведений.МТСД_ОбъектыДляПостобработкиПослеПолученияДанныхОтМТСД
	|ГДЕ НЕ ЕстьОшибкаПостОбработки ИЛИ ВыполнятьПовторнуюОбработкуПослеОшибки";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерОбъекта = МТСД_БСП_ОбщегоНазначения.МенеджерОбъектаПоСсылке(Выборка.Объект);
		
		ТекстОшибки = ""; ВыполнятьПовторнуюОбработкуПослеОшибки = Ложь;
		МенеджерОбъекта.ВыполнитьПостОбработкуПослеПолученияДанныхОтМТСД(Выборка.Объект, ТекстОшибки, ВыполнятьПовторнуюОбработкуПослеОшибки);
		
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			МенеджерЗаписи.ЕстьОшибкаПостОбработки = Истина;
			МенеджерЗаписи.ВыполнятьПовторнуюОбработкуПослеОшибки = ВыполнятьПовторнуюОбработкуПослеОшибки;
			МенеджерЗаписи.ТекстОшибки = ТекстОшибки;
			МенеджерЗаписи.Записать();
		Иначе
			МенеджерЗаписи.Удалить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Функция НовыйМенеджерЗаписи(Объект, УзелМТСД, Прочитать = Истина)
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Объект;
	МенеджерЗаписи.УзелМТСД = УзелМТСД;
	
	Если Прочитать Тогда
		МенеджерЗаписи.Прочитать();
	КонецЕсли;
	
	Возврат МенеджерЗаписи;
	
КонецФункции

#КонецОбласти
